{
    "2024-12-18": {
        "riddle": "היי אני חידה בעברית התשובה היא שלום?",
        "answer": "שלום"
    },
    "2025-01-09": {
        "riddle": "The more you take, the more you leave behind. What am I?",
        "answer": "footsteps"
    },
    "2025-01-10": {
        "riddle": "The more you take, the more you leave behind. What am I?",
        "answer": "footsteps"
    },
    "2025-01-11": {
        "riddle": "I speak without a mouth and hear without ears. I have no body, but I come alive with wind. What am I?",
        "answer": "echo"
    },
    "2025-01-12": {
        "riddle": "What has keys, but no locks; space, but no room; and you can enter, but not go in?",
        "answer": "keyboard"
    },
    "2025-01-13": {
        "riddle": "I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I?",
        "answer": "fire"
    },
    "2025-01-14": {
        "riddle": "What can travel around the world while staying in a corner?",
        "answer": "stamp"
    },
    "2025-01-15": {
        "riddle": "I have branches, but no fruit, trunk or leaves. What am I?",
        "answer": "bank"
    },
    "2025-01-16": {
        "riddle": "What has a head, a tail, is brown, and has no legs?",
        "answer": "penny"
    },
    "2025-01-17": {
        "riddle": "I'm tall when I'm young, and I'm short when I'm old. What am I?",
        "answer": "candle"
    },
    "2025-01-18": {
        "riddle": "What goes up but never comes down?",
        "answer": "age"
    },
    "2025-01-19": {
        "riddle": "I have keys, but no locks. I have space, but no room. You can enter, but can't go in. What am I?",
        "answer": "keyboard"
    },
    "2025-01-20": {
        "riddle": "What has many keys but can't open a single lock?",
        "answer": "piano"
    },
    "2025-01-21": {
        "riddle": "The more you take, the more you leave behind. What am I?",
        "answer": "footsteps"
    },
    "2025-01-22": {
        "riddle": "I am an odd number. Take away a letter and I become even. What number am I?",
        "answer": "seven"
    },
    "2025-01-23": {
        "riddle": "What can you catch, but not throw?",
        "answer": "cold"
    },
    "2025-01-24": {
        "riddle": "I have cities, but no houses. I have mountains, but no trees. I have water, but no fish. What am I?",
        "answer": "map"
    },
    "2025-01-25": {
        "riddle": "What has a neck but no head?",
        "answer": "bottle"
    },
    "2025-01-26": {
        "riddle": "What runs but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?",
        "answer": "river"
    },
    "2025-01-27": {
        "riddle": "What belongs to you, but other people use it more than you?",
        "answer": "name"
    },
    "2025-01-28": {
        "riddle": "I am taken from a mine and shut up in a wooden case, from which I am never released, and yet I am used by everyone. What am I?",
        "answer": "pencil lead"
    },
    "2025-01-29": {
        "riddle": "What has a head and a tail but no body?",
        "answer": "coin"
    },
    "2025-01-30": {
        "riddle": "What can you break, even if you never pick it up or touch it?",
        "answer": "promise"
    },
    "2025-01-31": {
        "riddle": "What gets wet while drying?",
        "answer": "towel"
    },
    "2025-02-01": {
        "riddle": "What has many teeth, but cannot bite?",
        "answer": "comb"
    },
    "2025-02-02": {
        "riddle": "I am always hungry; I must always be fed. The finger I touch will soon turn red. What am I?",
        "answer": "fire"
    }
}